using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace _24._01._08_Overloaded_Operators
{
    internal class Program
    {
        static void Main(string[] args)
        {
            /*Перевантаження операторів
                Завдання:
                Створити два класи, які будуть описувати фігуру:
                Square. Містить властивість A - довжина сторони квадрату.
                Rectangle. Містить властивості A, B - довжина сторін прямокутника.
                Написати для класів конструктор по замовчуванню та параметризований, перевизначити метод ToString та перевантажити наступні оператори:
                (++ --) - оператори змінюють розмір кожної з сторін на одиницю відповідно
                (+ - * /) - оператори створюють нову фігуру зробивши відповідну операцію з кожною зі сторін. Перевіряйте, щоб сторона не була від'ємною.
                (< > <= >= == !=) - оператори порівнюють відповідні фігури по розмірам сторін. Для операторів рівності перевизначте базовий метод Equals в парі з методом GetHashCode.
                (true false) - умовою істиності фігури є перевірка чи розміри сторін відмінні від нуля.
                Також перевизначити оператори приведення типу в наступних варіантах:
                неявне приведення (implicit) квадрату до прямокутника
                явне приведення (explicit) прямокутника до квадрату
                неявне приведення квадрату до типу int
                явне приведення прямокутника до типу int*/
        }
    }
}
