using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace _23._12._15_String
{
    internal class Program
    {
        static void Main(string[] args)
        {
            /*  Task 1:
                Вставити в задану позицію рядка інший рядок.
                    Task 2:
                Визначити, чи є рядок паліндромом. 
                Паліндром – це число, слово або фраза, яка однаково 
                читається в обох напрямках.
                    Task 3:
                Дано текст. Визначте відсоткове відношення малих і великих літер 
                до загальної кількості символів в ньому.
                    Task 4:
                Дано масив слів. Замінити останні три символи слів, 
                що мають обрану довжину, на символ "$".
                    Task 5:
                Знайти слово, що стоїть в тексті під певним номером, і вивести його першу букву.
                    Task 6:
                Дано рядок слів, розділених пробілами. Між словами може бути кілька пробілів, 
                на початку і вкінці рядка також можуть бути пробіли. Ви повинні змінити рядок так, 
                щоб на початку і вкінці пробілів не було, а слова були розділені поодиноким 
                символом "*" (зірочка).
                    Task 7:
                Користувач вводить слова, поки не буде введено слово з символом крапки вкінці. 
                Сформувати з введених слів рядок, розділивши їх комою з пробілом. 
                Застосувати StringBuilder.
            */

             Console.WriteLine();
        }
    }
}
