using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace _24._01._24_Dictionary_2
{
    internal class Program
    {
        static void Main(string[] args)
        {
            /*
               Завдання 2***. 
                    Програма «Статистика»
                        Підрахувати, скільки разів кожне слово зустрічається у заданому
                        текстi. Результат записати до колекції Dictionary <TKey, TValue>. Текс використовувати із додатка 1.
                        Вивести статистику за текстом у вигляді таблиці (рис. 1).
                        
                    Додаток 1.
                           Ось будинок, який збудував Джек. А це пшениця, яка
                           у темній коморі зберігається у будинку, який збудував
                           Джек. А це веселий птах-синиця, який часто краде
                           пшеницю, яка в темній коморі зберігається у будинку,
                           який збудував Джек.
            */

        }
    }
}
