using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace _24._01._22_Events
{
    internal class Program
    {
        static void Main(string[] args)
        {
            /*
            Реалізувати на подійній моделі функціонал фінансової біржі.
                
            Створити клас «Біржа», який буде містити методи для імітації зміни курса та подію 
            досягнення максиму або мінімуму курсу.
                
            Також є покупці-трейдери, які мають кількість своєї валюти та обробники зміни курсу і 
            відповідоно до своїх цілей виконуватимуть роботу по продажу або купівлі грошей(акцій).
                
            Реалізацію генерації курсу розробляйте на власний розсуд (рандом).
            */





        }
    }
}
